/******************** (C) COPYRIGHT 2012 Robottime ********************
* 文件名    : lib_arm.c
* 作者       : sinbad
* 版本       : V1.0.0
* 日期       : 2012.3.7
* 所属产品 : 探索者ARM7 LPC2138主控制板
* 功能       : 主控板各个接口的控制函数，如读取传感器状态、控制舵机、LED等
********************************************************************/

#include "config.h" 
#include "lib_io.h"

/********************定义主控板各个接口********************/
int port_ledin[4][2][2];      //传感器状态灯
int port_input[4][2][2];      //传感器信号端口
int port_ledout[8][2];       //输出信号灯
uint8 port_output[8][2][2];  //输出信号端口
int port_ABC[2][2];         //通道端口
int port_IR[2];            //红外端口
int port_timer[3][2];      //定时器端口
uint32 servo_fre=20000;    //PWM脉宽
uint32 xtal=11059200;      //晶振频率
uint16 bps=9600;          //波特率
void LedIn(uint8 Num,uint8 Color);


/**********************************************************************************************************
** 函数名称 ：Initial_ARM
** 函数功能 ：主控板开机初始化
** 入口参数 ：无
** 返  回 值 ：无
**********************************************************************************************************/
void Initial_ARM() 
{
	/****传感器状态灯端口设置****/
	port_ledin[0][0][0]=1;
	port_ledin[0][0][1]=18;
	port_ledin[0][1][0]=0;
	port_ledin[0][1][1]=25;
	port_ledin[1][0][0]=1;
	port_ledin[1][0][1]=27;
	port_ledin[1][1][0]=0;
	port_ledin[1][1][1]=20;
	port_ledin[2][0][0]=1;
	port_ledin[2][0][1]=29;
	port_ledin[2][1][0]=0;
	port_ledin[2][1][1]=18;
	port_ledin[3][0][0]=1;
	port_ledin[3][0][1]=20;
	port_ledin[3][1][0]=0;
	port_ledin[3][1][1]=15;
	
	/****传感器端口设置****/	
	port_input[0][0][0]=0;
	port_input[0][0][1]=22;
	port_input[0][1][0]=1;
	port_input[0][1][1]=19;
	port_input[1][0][0]=0;
	port_input[1][0][1]=23;
	port_input[1][1][0]=1;
	port_input[1][1][1]=28;
	port_input[2][0][0]=0;
	port_input[2][0][1]=19;
	port_input[2][1][0]=1;
	port_input[2][1][1]=30;
	port_input[3][0][0]=0;
	port_input[3][0][1]=17;
	port_input[3][1][0]=1;
	port_input[3][1][1]=21;
	
	/****输出状态灯端口设置****/		
	port_ledout[0][0]=1;
	port_ledout[0][1]=16;
	port_ledout[1][0]=0;
	port_ledout[1][1]=31;
	port_ledout[2][0]=1;
	port_ledout[2][1]=31;
	port_ledout[3][0]=1;
	port_ledout[3][1]=25;
	port_ledout[4][0]=0;
	port_ledout[4][1]=6;
	port_ledout[5][0]=1;
	port_ledout[5][1]=24;
	port_ledout[6][0]=1;
	port_ledout[6][1]=23;
	port_ledout[7][0]=0;
	port_ledout[7][1]=13;
	
	/****输出端口设置****/		
	port_output[0][0][0]=0;
	port_output[0][0][1]=21;
	port_output[0][1][0]=0;
	port_output[0][1][1]=29;
	port_output[1][0][0]=0;
	port_output[1][0][1]=7;
	port_output[1][1][0]=0;
	port_output[1][1][1]=28;
	port_output[2][0][0]=0;
	port_output[2][0][1]=8;
	port_output[2][1][0]=0;
	port_output[2][1][1]=27;
	port_output[3][0][0]=0;
	port_output[3][0][1]=9;
	port_output[4][0][0]=0;
	port_output[4][0][1]=0;
	port_output[4][1][0]=0;
	port_output[4][1][1]=11;
	port_output[5][0][0]=0;
	port_output[5][0][1]=1;
	port_output[5][1][0]=1;
	port_output[5][1][1]=22;
	port_output[6][0][0]=0;
	port_output[6][0][1]=4;
	port_output[6][1][0]=0;
	port_output[6][1][1]=5;
	port_output[7][0][0]=0;
	port_output[7][0][1]=10;
	port_output[7][1][0]=0;
	port_output[7][1][1]=12;
	
	/****通道端口设置****/		
	port_ABC[0][0]=1;
	port_ABC[0][1]=17;
	port_ABC[1][0]=0;
	port_ABC[1][1]=26;

	/****红外端口设置****/	
	port_IR[0]=0;
	port_IR[1]=16;
	
	/****定时器端口设置****/	
	port_timer[0][0]=0;
	port_timer[0][1]=29;
	port_timer[1][0]=0;
	port_timer[1][1]=28;
	port_timer[2][0]=0;
	port_timer[2][1]=27;
	
	/****传感器状态灯置灭****/		
	 LedIn(1,0);
	 LedIn(2,0);
	 LedIn(3,0);
	 LedIn(4,0);
}

/**********************************************************************************************************
** 函数名称 ：Motor
** 函数功能 ：马达控制函数
** 入口参数 ：Num ：马达端口序号，输出端口7~8；
		     Stat ：马达转动状态，0 - 停止，1 - 正转， 2 - 反转；
** 返  回 值 ：无
**********************************************************************************************************/
void Motor(uint8 Num,uint16 stat)
{         
	if(Num==7)
	{
		if(stat==0) {GPIO_Out(0,4,0);GPIO_Out(0,5,0);}
		if(stat==1) {GPIO_Out(0,4,1);GPIO_Out(0,5,0);}
		if(stat==2) {GPIO_Out(0,4,0);GPIO_Out(0,5,1);}
	}
	if(Num==8)
	{
		if(stat==0) {GPIO_Out(0,10,0);GPIO_Out(0,12,0);}
		if(stat==1) {GPIO_Out(0,10,1);GPIO_Out(0,12,0);}
		if(stat==2) {GPIO_Out(0,10,0);GPIO_Out(0,12,1);}
	}
}

/**********************************************************************************************************
** 函数名称 ：LedIn
** 函数功能 ：设置传感器状态灯的颜色
** 入口参数 ：Num ：传感器状态灯序号，1~4；
		    Color：传感器状态灯的颜色，|| 0 - 灭 || 1 - 红色 || 2 - 蓝色 ||
** 返  回 值 ：无
**********************************************************************************************************/
void LedIn(uint8 Num,uint8 Color)
{
	if(Color==0)
	{
		GPIO_Out(port_ledin[Num-1][0][0],port_ledin[Num-1][0][1],0);
		GPIO_Out(port_ledin[Num-1][1][0],port_ledin[Num-1][1][1],0);
	}
	if(Color==1)
	{
		GPIO_Out(port_ledin[Num-1][0][0],port_ledin[Num-1][0][1],1);
		GPIO_Out(port_ledin[Num-1][1][0],port_ledin[Num-1][1][1],0);
	}
	if(Color==2)
	{
		GPIO_Out(port_ledin[Num-1][0][0],port_ledin[Num-1][0][1],0);
		GPIO_Out(port_ledin[Num-1][1][0],port_ledin[Num-1][1][1],1);
	}
}

/**********************************************************************************************************
** 函数名称 ：Input
** 函数功能 ：读取传感器检测状态
** 入口参数 ：Num ：传感器端口序号，1~4；
		    Pin    ：传感器的引脚号，|| 1 - 传感器信号引脚 || 2 - 传感器模式引脚 ||
** 返  回 值 ：|| 0 - 传感器无触发 || 1 - 传感器有触发 ||
**********************************************************************************************************/
int Input(uint8 Num,uint8 Pin) 
{
	return(GPIO_In(port_input[Num-1][Pin-1][0],port_input[Num-1][Pin-1][1],0));
}

/**********************************************************************************************************
** 函数名称 ：LedOut
** 函数功能 ：设置输出端口状态灯
** 入口参数 ：Num ：输出端口序号，1~8；
		    Stat  ：指示灯状态，|| 0 - 灭灯 || 1 - 亮灯 ||
** 返  回 值 ：无
**********************************************************************************************************/
void LedOut(uint8 Num,uint8 Stat) //输出指示灯(参数1：序号,1~8；参数2：亮或灭，0-灭，1-亮)
{
	GPIO_Out(port_ledout[Num-1][0],port_ledout[Num-1][1],Stat);
}


/**********************************************************************************************************
** 函数名称 ：Servo
** 函数功能 ：舵机控制函数
** 入口参数 ：Num ：舵机端口序号，输出端口1~6；
		    Ang  ：舵机转动角度，0~180；
** 返  回 值 ：无
**********************************************************************************************************/
void Servo(uint8 Num,uint16 Ang) //控制舵机(参数1：序号,1~6；参数2：角度,0~180)
{         
	PWM(port_output[Num-1][0][0],port_output[Num-1][0][1],((100*Ang)/9+500),servo_fre);
}
 

/**********************************************************************************************************
** 函数名称 ：SetTimer
** 函数功能 ：设置定时中断周期，使用前先开启定时中断"TimerOpen"
** 入口参数 ：Timer ：定时周期
** 返  回 值 ：无
**********************************************************************************************************/
void SetTimer(uint32 Timer) 
{
	Time_irq(0,18,1,Timer,xtal,1);
}


/**********************************************************************************************************
** 函数名称 ：TimerOpen
** 函数功能 ：开启定时中断
** 入口参数 ：无
** 返  回 值 ：无
**********************************************************************************************************/
void TimerOpen() 
{
	T1IR=0x01;
	IRQ_End(0x00000000);
}


/**********************************************************************************************************
** 函数名称 ：SetMemory
** 函数功能 ：启动I2C储存芯片功能
** 入口参数 ：priority：中断优先级
** 返  回 值 ：无
**********************************************************************************************************/
void SetMemory(uint8 priority)
{
	I2cInit(0,2,3,100000,priority);
}


/**********************************************************************************************************
** 函数名称 ：SaveData
** 函数功能 ：储存数据
** 入口参数 ：address：储存数据的地址，0~65535；
		    data     ：需要存储的数据
** 返  回 值 ：无
**********************************************************************************************************/
void SaveData(uint32 address,uint8 data) //存储数据，参数1：地址（0～65535）；参数2：数据（0～255）
{
                       T1TCR  = 0x00; 
                       T0TCR  = 0x00;
                       PWMMCR  = 0x00;	
   		               T0IR = 0x01;
   		               T1IR=0x01;
   			           PWMIR = 0x01;   
   			           EXTINT=0x01;
   		               I2CONCLR=0x08;            // 复位PWM中断标志			/* 使能I2C中断 						*/
  	                   VICIntEnClr =((1 << 4)|(1 << 8)|(1 << 0x0e)|(1 << 0x06));	
	I2C_WriteNByte(0xa0, 2, address*8,data, 1);
    T1TCR  = 0x01; 
    T0TCR  = 0x01;
    VICIntEnClr = (1 << 9);
    VICIntEnable = ((1 << 4)|(1 << 0x0e)|(1 << 0x06));
}

/**********************************************************************************************************
** 函数名称 ：LoadData
** 函数功能 ：读取数据
** 入口参数 ：address：储存数据的地址，0~65535；
** 返  回 值 ：该地址存储的数据。
**********************************************************************************************************/
uint8 LoadData(uint32 address) //读取数据，参数1：地址（0～65535）
{
	T1TCR  = 0x00; 
                       T0TCR  = 0x00;
                       PWMMCR  = 0x00;	
   		               T0IR = 0x01;
   		               T1IR=0x01;
   			           PWMIR = 0x01;   
   			           EXTINT=0x01;
   		               I2CONCLR=0x08;            // 复位PWM中断标志			/* 使能I2C中断 						*/
  	                   VICIntEnClr =((1 << 4)|(1 << 8)|(1 << 0x0e)|(1 << 0x06));	
	return(I2C_ReadNByte(0xa0, 2, address*8, 1));
	  T1TCR  = 0x01; 
      T0TCR  = 0x01;
      VICIntEnClr = (1 << 9);
      VICIntEnable = ((1 << 4)|(1 << 0x0e)|(1 << 0x06));
}

/**********************************************************************************************************
** 函数名称 ：ChannelABC
** 函数功能 ：读取ABC通道开关位置
** 入口参数 ：无
** 返  回 值 ：0 - A，1 - B，2 - C
**********************************************************************************************************/
int ChannelABC() 
{         
	if( GPIO_In( 1 , 17, 0 ) == 1 ) return( 1 );
		else if( GPIO_In( 0 , 26 , 0 ) == 1 ) return( 0 );
			else return( 2 );
}

