/******************** (C) COPYRIGHT 2012 Robottime ********************
* 文件名    : perception.c
* 作者       : sinbad
* 版本       : V1.0.0
* 日期       : 2012.3.28
* 所属产品 : 探索者ARM7 LPC2138主控制板
* 功能       : 将机器人感知的各种外界信号，如传感器状态、amarino数据等，与机器人的
                  动作行为产生关联。
********************************************************************/

/*******************************************************************************
* 程序名    : Perception_Amarino
* 功能       : 取amarino的数据
* 入口参数 : x/y/z依次为所选amarino传感器的1~3位数据
* 返回值    : 无
*******************************************************************************/
void Perception_Amarino(int x, int y, int z)
{

}